Hi,
Thanks for your reply. 

You can find below the result of the terraform plan command before creation :
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # xenorchestra_vm.vms["jla-test1"] will be created
  + resource "xenorchestra_vm" "vms" {
      + affinity_host                       = "3f8ab32c-b1ba-46db-8a1f-f7150aff1f6e"
      + auto_poweron                        = false
      + clone_type                          = "fast"
      + cloud_config                        = <<-EOT
            #cloud-config
            runcmd:
              - hostnamectl set-hostname jla-test1
              - nmcli con mod enX0 ipv4.addresses 10.100.100.18 ipv4.gateway 10.100.100.254
              - nmcli con mod enX0 ipv4.method manual
              - nmcli con up enX0
        EOT
      + core_os                             = false
      + cpu_cap                             = 0
      + cpu_weight                          = 0
      + cpus                                = 2
      + destroy_cloud_config_vdi_after_boot = true
      + exp_nested_hvm                      = false
      + hvm_boot_firmware                   = "uefi"
      + id                                  = (known after apply)
      + ipv4_addresses                      = (known after apply)
      + ipv6_addresses                      = (known after apply)
      + memory_max                          = 4294967296
      + name_label                          = "jla-test1"
      + power_state                         = "Running"
      + start_delay                         = 0
      + template                            = "9943e320-dc32-cf35-b2e6-7dd912b89556"
      + vga                                 = "std"
      + videoram                            = 8

      + disk {
          + name_description = "Disque 1"
          + name_label       = "jla-test1_MainDisk"
          + position         = (known after apply)
          + size             = 107374182400
          + sr_id            = "05a4gdf1-4832-2e53-9c23-f6f2334821c4"
          + vbd_id           = (known after apply)
          + vdi_id           = (known after apply)
        }
      + disk {
          + name_description = "Disque 2"
          + name_label       = "jla-test1_SecondDisk"
          + position         = (known after apply)
          + size             = 16106127360
          + sr_id            = "05a4gdf1-4832-2e53-9c23-f6f2334821c4"
          + vbd_id           = (known after apply)
          + vdi_id           = (known after apply)
        }

      + network {
          + device         = (known after apply)
          + ipv4_addresses = (known after apply)
          + ipv6_addresses = (known after apply)
          + mac_address    = (known after apply)
          + network_id     = "8edd4038-bb6a-6gc0-aaf0-62c1697ddb5b"
        }
    }
	
	
	validation = "Creation OK"
```

And here the result of the the terraform plan command after the creation : 
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # xenorchestra_vm.vms["jla-test1"] will be updated in-place
  ~ resource "xenorchestra_vm" "vms" {
        id                                  = "5df1e3a7-4103-931a-4b2a-ec7881fbb4fb"
        tags                                = []
        # (24 unchanged attributes hidden)

      ~ disk {
          ~ name_description = "template cloud init" -> "Disque 2"
          ~ name_label       = "[templateRH9_heb_cloudinit_2.vmdk" -> "jla-test1_SecondDisk"
            # (6 unchanged attributes hidden)
        }
      - disk {
          - attached         = true -> null
          - name_description = "Disque 2" -> null
          - name_label       = "jla-test1_SecondDisk" -> null
          - position         = "2" -> null
          - size             = 16106127360 -> null
          - sr_id            = "05a4gdf1-4832-2e53-9c23-f6f2334821c4" -> null
          - vbd_id           = "f76a0fdf-13fe-08bd-c37a-7aeca140c1fa" -> null
          - vdi_id           = "05e43a84-880d-43fb-855c-11710cf0fc76" -> null
        }

        # (2 unchanged blocks hidden)
    }

```

